2012/10/oct12.org
-October 2012- \\
#Export options here: \\
#+OPTIONS: toc:1

* To do, General

** DONE [05-10-2012] Finish application for COST reimbursement

** DONE [05-10-2012] Send off Lizzie's card
- [08-10-2012] address awaiting confirmation:
  143 Hollingdean Terrace
  BN1 7HF
- [08-10-2012] Confirmed by Andrew
- [09-10-2012] Addressed and stamped -> send it!
- [09-10-2012] Sent

** DONE [05-10-2012] Put in an order for APC IR fibres with Hiroki
[08-10-2012] Hiroki will put in the order on Matthias' grant code
** DONE [05-10-2012] E-mail Tom Armour for ballista accounts for the rest of the group
*** DONE Add:
Stephen
Michael
amy
Markus
Jack

*** Delete:
Alex
Anders
Lizzie
Peter
Andrew (wait)

** DONE [05-10-2012] Order re-entrant window parts
- PW-S-00788, 60mm diameter, 9.5mm thickness, BK7 (for protection from 240nm pulse laser).
- Quote requested from Laseroptik
- jebert@laseroptik.de
- BK7 will take 6 weeks [08-10-2012]
- Waiting for lead time and quote on fused silica
- Fused silica x1 E250 Quotation No. A12-0997 [09-10-2012]
- [10-10-2012] Quote has gone to Gill so she can pay with credit card
- [11-10-2012] Haven't heard back from Gill or LaserOptik, chase up
- [15-10-2012] Part arrived. In optics drawers in the molecule lab

** DONE <2012-10-05 Fri> Look for info on Duke University's high NA custom lens
- PI Jungsang Kim
- No information in first glance over theses [08-10-2012]
- <2012-10-31 Wed> Closing - no info easily available in theses.
** DONE [05-10-2012] Make sure everyone knows about Ballista and the google account
- [08-10-2012] Testing out google groups for making announcements
- [09-10-2012] Announced in group meeting 

** DONE [09-10-2012] Confirm everyone is added to itcmsussex mailing list
- [09-10-2012] Sent invitations to undergraduate students, re-sent to Kevin
- [10-10-2012] Everyone except undergraduates
** DONE [05-10-2012] Set weekly time for journal club
- [10-10-2012] Preliminary 2pm Fridays, ask Hiroki
- [11-10-2012] All agreed 2pm Friday, fortnightly
** DONE [08-10-2012] Chase up Thorlabs order
- Missing mirror mount
- Purchase order: 8010103
- [08-10-2012] Coming tomorrow
- [09-10-2012] Not arrived, chase up tomorrow!
- [10-10-2012] Arrived, Alan will do the job next week, hand over to Stephen

** DONE [08-10-2012] Get everyone to submit to the ITCMsussex calendar
- [10-10-2012] Everyone except UG have updated

** DONE [09-10-2012] Make everyone aware of iPython notebook!
- Put forward as a replacement for Matlab
- Hiroki will have details on windows installations
- Matthias suggest we spend a theory session on applications for data analysis

** DONE [09-10-2012] Ask about an article manager for papers
- Mendeley (Hiroki) [09-10-2012]
- Evernote (Andrew) [09-10-2012]
  
** DONE [10-10-2012] Buy toner for Kevin's printer
- The printer is: HP LaserJet P1505
- Current toner cartridge is: HP 36A (CB436A)
- Requisition number 9011399

** DONE [10-10-2012] Organise papers with Mendeley
- [09-10-2012] Installed, imported all papers, needs organising
- <2012-10-23 Tue> Organised loosely into folders. Would prefer a
  `tag' method of organisation... will look into that.

** DONE [16-10-2012] Get new notebook from home
** TODO <2012-10-23 Tue> Order new notebooks
- Can I get these on the grant? Probably not. Maybe wait `til payday
  <2012-10-30 Tue>
- <2012-10-31 Wed> Money not through yet. Putting an agenda entry in
  for Monday to remind me <2012-11-05 Mon>
** DONE [16-10-2012] Get whiteboard and projector for journal club
- Whiteboard from MPhys lab, portable projector from Sally

** DONE [18-10-2012] Give Kevin feedback on his thesis chapter
- Finished reading, needs another iteration or two
- [22-10-2012] Feedback given last Friday, sent back for another iteration

** DONE <2012-10-23 Tue> Make RS order
- Bulbs (743-858)
- ICD3 programmer (660-1264) [X]
- ADCs (when Dave chooses them) 
- N type to BNC adaptor (761-9939)
- RAM for Stephen, i946PL/GZ, DDR2-333 2x1GB, PC25300-u (333MHz 667
  Mb/s/pin)  [X]
- RS don't stock that RAM ^
- <2012-10-29 Mon> Order saved on RS website need purchase order from
  agresso.
- <2012-10-30 Tue> Order made and sent out
