2012/10/oct12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>-October 2012- \\</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="-October 2012- \\"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-06 11:35:11 GMT"/>
<meta name="author" content="Nic"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">-October 2012- \\</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 To do, General</a></li>
<li><a href="#sec-2">2 To do, Molecular Lab Experiments</a></li>
<li><a href="#sec-3">3 Journal &amp; Theory club</a></li>
<li><a href="#sec-4">4 To do, non-work</a></li>
<li><a href="#sec-5">5 Handy org-mode sequences</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> To do, General</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> [05-10-2012] Finish application for COST reimbursement</h3>
<div class="outline-text-3" id="text-1-1">


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class="done DONE">DONE</span> [05-10-2012] Send off Lizzie's card</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>[08-10-2012] address awaiting confirmation:
  143 Hollingdean Terrace
  BN1 7HF
</li>
<li>[08-10-2012] Confirmed by Andrew
</li>
<li>[09-10-2012] Addressed and stamped -&gt; send it!
</li>
<li>[09-10-2012] Sent
</li>
</ul>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="done DONE">DONE</span> [05-10-2012] Put in an order for APC IR fibres with Hiroki</h3>
<div class="outline-text-3" id="text-1-3">

<p>[08-10-2012] Hiroki will put in the order on Matthias' grant code
</p></div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> <span class="done DONE">DONE</span> [05-10-2012] E-mail Tom Armour for ballista accounts for the rest of the group</h3>
<div class="outline-text-3" id="text-1-4">


</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> <span class="done DONE">DONE</span> Add:</h4>
<div class="outline-text-4" id="text-1-4-1">

<p>Stephen
Michael
amy
Markus
Jack
</p>
</div>

</div>

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Delete:</h4>
<div class="outline-text-4" id="text-1-4-2">

<p>Alex
Anders
Lizzie
Peter
Andrew (wait)
</p>
</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> <span class="done DONE">DONE</span> [05-10-2012] Order re-entrant window parts</h3>
<div class="outline-text-3" id="text-1-5">

<ul>
<li>PW-S-00788, 60mm diameter, 9.5mm thickness, BK7 (for protection from 240nm pulse laser).
</li>
<li>Quote requested from Laseroptik
</li>
<li>jebert@laseroptik.de
</li>
<li>BK7 will take 6 weeks [08-10-2012]
</li>
<li>Waiting for lead time and quote on fused silica
</li>
<li>Fused silica x1 E250 Quotation No. A12-0997 [09-10-2012]
</li>
<li>[10-10-2012] Quote has gone to Gill so she can pay with credit card
</li>
<li>[11-10-2012] Haven't heard back from Gill or LaserOptik, chase up
</li>
<li>[15-10-2012] Part arrived. In optics drawers in the molecule lab
</li>
</ul>


</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> <span class="done DONE">DONE</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-05 Fri</span></span> Look for info on Duke University's high NA custom lens</h3>
<div class="outline-text-3" id="text-1-6">

<ul>
<li>PI Jungsang Kim
</li>
<li>No information in first glance over theses [08-10-2012]
</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2012-10-31 Wed</span></span> Closing - no info easily available in theses.
</li>
</ul>

</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> <span class="done DONE">DONE</span> [05-10-2012] Make sure everyone knows about Ballista and the google account</h3>
<div class="outline-text-3" id="text-1-7">

<ul>
<li>[08-10-2012] Testing out google groups for making announcements
</li>
<li>[09-10-2012] Announced in group meeting 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> <span class="done DONE">DONE</span> [09-10-2012] Confirm everyone is added to itcmsussex mailing list</h3>
<div class="outline-text-3" id="text-1-8">

<ul>
<li>[09-10-2012] Sent invitations to undergraduate students, re-sent to Kevin
</li>
<li>[10-10-2012] Everyone except undergraduates
</li>
</ul>

</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> <span class="done DONE">DONE</span> [05-10-2012] Set weekly time for journal club</h3>
<div class="outline-text-3" id="text-1-9">

<ul>
<li>[10-10-2012] Preliminary 2pm Fridays, ask Hiroki
</li>
<li>[11-10-2012] All agreed 2pm Friday, fortnightly
</li>
</ul>

</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> <span class="done DONE">DONE</span> [08-10-2012] Chase up Thorlabs order</h3>
<div class="outline-text-3" id="text-1-10">

<ul>
<li>Missing mirror mount
</li>
<li>Purchase order: 8010103
</li>
<li>[08-10-2012] Coming tomorrow
</li>
<li>[09-10-2012] Not arrived, chase up tomorrow!
</li>
<li>[10-10-2012] Arrived, Alan will do the job next week, hand over to Stephen
</li>
</ul>


</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> <span class="done DONE">DONE</span> [08-10-2012] Get everyone to submit to the ITCMsussex calendar</h3>
<div class="outline-text-3" id="text-1-11">

<ul>
<li>[10-10-2012] Everyone except UG have updated
</li>
</ul>


</div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> <span class="done DONE">DONE</span> [09-10-2012] Make everyone aware of iPython notebook!</h3>
<div class="outline-text-3" id="text-1-12">

<ul>
<li>Put forward as a replacement for Matlab
</li>
<li>Hiroki will have details on windows installations
</li>
<li>Matthias suggest we spend a theory session on applications for data analysis
</li>
</ul>


</div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> <span class="done DONE">DONE</span> [09-10-2012] Ask about an article manager for papers</h3>
<div class="outline-text-3" id="text-1-13">

<ul>
<li>Mendeley (Hiroki) [09-10-2012]
</li>
<li>Evernote (Andrew) [09-10-2012]
</li>
</ul>


</div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> <span class="done DONE">DONE</span> [10-10-2012] Buy toner for Kevin's printer</h3>
<div class="outline-text-3" id="text-1-14">

<ul>
<li>The printer is: HP LaserJet P1505
</li>
<li>Current toner cartridge is: HP 36A (CB436A)
</li>
<li>Requisition number 9011399
</li>
</ul>


</div>

</div>

<div id="outline-container-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> <span class="done DONE">DONE</span> [10-10-2012] Organise papers with Mendeley</h3>
<div class="outline-text-3" id="text-1-15">

<ul>
<li>[09-10-2012] Installed, imported all papers, needs organising
</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2012-10-23 Tue</span></span> Organised loosely into folders. Would prefer a
  `tag' method of organisation&hellip; will look into that.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> <span class="done DONE">DONE</span> [16-10-2012] Get new notebook from home</h3>
<div class="outline-text-3" id="text-1-16">

</div>

</div>

<div id="outline-container-1-17" class="outline-3">
<h3 id="sec-1-17"><span class="section-number-3">1.17</span> <span class="todo TODO">TODO</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-23 Tue</span></span> Order new notebooks</h3>
<div class="outline-text-3" id="text-1-17">

<ul>
<li>Can I get these on the grant? Probably not. Maybe wait `til payday
 <span class="timestamp-wrapper"> <span class="timestamp">2012-10-30 Tue</span></span><br/>
</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2012-10-31 Wed</span></span> Money not through yet. Putting an agenda entry in
  for Monday to remind me <span class="timestamp-wrapper"> <span class="timestamp">2012-11-05 Mon</span></span>
</li>
</ul>

</div>

</div>

<div id="outline-container-1-18" class="outline-3">
<h3 id="sec-1-18"><span class="section-number-3">1.18</span> <span class="done DONE">DONE</span> [16-10-2012] Get whiteboard and projector for journal club</h3>
<div class="outline-text-3" id="text-1-18">

<ul>
<li>Whiteboard from MPhys lab, portable projector from Sally
</li>
</ul>


</div>

</div>

<div id="outline-container-1-19" class="outline-3">
<h3 id="sec-1-19"><span class="section-number-3">1.19</span> <span class="done DONE">DONE</span> [18-10-2012] Give Kevin feedback on his thesis chapter</h3>
<div class="outline-text-3" id="text-1-19">

<ul>
<li>Finished reading, needs another iteration or two
</li>
<li>[22-10-2012] Feedback given last Friday, sent back for another iteration
</li>
</ul>


</div>

</div>

<div id="outline-container-1-20" class="outline-3">
<h3 id="sec-1-20"><span class="section-number-3">1.20</span> <span class="done DONE">DONE</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-23 Tue</span></span> Make RS order</h3>
<div class="outline-text-3" id="text-1-20">

<ul>
<li>Bulbs (743-858)
</li>
<li>ICD3 programmer (660-1264) [X]
</li>
<li>ADCs (when Dave chooses them) 
</li>
<li>N type to BNC adaptor (761-9939)
</li>
<li>RAM for Stephen, i946PL/GZ, DDR2-333 2x1GB, PC25300-u (333MHz 667
  Mb/s/pin)  [X]
</li>
<li>RS don't stock that RAM ^
</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2012-10-29 Mon</span></span> Order saved on RS website need purchase order from
  agresso.
</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2012-10-30 Tue</span></span> Order made and sent out
</li>
</ul>

</div>

</div>
