2012/10/oct12.org
** TODO <2012-10-29 Mon> order RAM for stephen
- RAM for Stephen, i946PL/GZ, DDR2-333 2x1GB, PC25300-u (333MHz 667
  Mb/s/pin)  [X]
- RS don't stock that RAM ^
- <2012-10-30 Tue> I will order the RAM if Stephen can find it
** DONE [X] <2012-10-23 Tue> Find/order a second PIC programmer
- MPLAB ICD3 [X] We already have a second one.

** DONE <2012-10-30 Tue> Test APC in-couplers from BSP
- Kevin's taken on this job
  

* To do, Molecular Lab Experiments

** DONE [05-10-2012] Contact Parker about valve driver
"Iota One" -> compatible with series 9 pulsed valve?
Valve made by:
Pressure and Flow ltd: 01788 560426
Example part number: 009-1668-900

Iota One Pulse Valve Driver
----------------------------------------------------
Hello Nicholas,
 
Please find the requested data attached.
 
The 060-0001-900 are £3220.45 each. Delivery: 9 weeks.
 
NOTE: This product is NOT CE marked and thus a written concesion is required when ordering!
 
If you need further information or assistance, please do not hesitate to contact me.
 
Best Regards,
 
Nick Argyle
Sales Engineer
UK & Ireland
Tel.: +44 (0) 1788 560426 / Fax: +44 (0) 1788 561228
E-Mail: uk@sensortechnics.com

Sensortechnics Ltd (a First Sensor Company)
Aspect Business Centre, 66C Somers Road, Rugby, Warks. CV22 7DH
Internet: www.sensortechnics.com

** DONE [09-10-2012] Inquire at Oxford about getting a pulsed valve driver made
- [10-10-2012] E-mail sent to Chris Rennick
- [10-10-2012] Chris might be able to send us one of their old
  controllers, different only in that it has an external HV supply
- Needs model resistance and inductance in case their circuit needs to
  be re-tuned to drive our valve
- The model we have is the 12 Watts/20VDC/594mA/33ohm one, no data on
  inductance, Amy might have measured it at 80mH. I'm measuring, using
  the LCR meter, 5.8 mH.
- Above data sent to Chris
- [11-10-2012] Chris checking details of our valve, and whether their
  spare will be needed soon
- [2012-10-22] No word from Chris since I heard from Laura that he was
  looking for it. Perhaps it's not to be found. The old pulsed valve
  circuit is nearly rebuilt, and Matthias has some designs from the
  Willitsch group in Basel for a different kind of piezo
  valve. Therefore I'm shelving this entry.
- <2012-10-23 Tue> *Update: Chris will send us his, and a spare pcb for us
  to make our own replacement

** DONE <2012-10-05 Fri> Test the PZT valve using leak-detector
*** DONE [05-10-2012] Test with PZT amplifier
- Opens and closes fully. 
- Voltages required not totally predictable, but if
  closed enough manually, and voltage high enough, then should be
  reliable. 
- PZT amplifier can't open and close fast enough to test
  dynamically. Must repair fast electronics
*** DONE [08-10-2012] Order MOSFETs and driver
- Mosfet
  Farnell: 9935584
  STP 20NM60FP: MOSFET N
- Driver
  Farnell: 1216117
  EL7104CN
- [08-10-2012] Ordered, Purchase order no. MPS/8010609 next day
  delivery 

*** DONE [08-10-2012] Repair electronics
- Replace MOSFET and driver
- [09-10-2012] MOSFETs and driver have arrived
- Make new circuit board?
- [18-10-2012] New circuit board made
- Not working. Debug time.
- [22-10-2012] Still debugging, something wrong with wiring
  (transistors all functioning fine)
- Main board electronics are all functioning. Need to repair the
  MOSFET driver.
- <2012-10-23 Tue> We are getting a solenoid valve controller from Oxford,
  but I will finish this up anyway as a backup, in case performance
  from that controller/valve is not sufficient
- <2012-10-23 Tue> Valve electronics fixed, and will be shelved as a
  backup for the solenoid valve

