2012/10/oct12.html

<div id="outline-container-1-21" class="outline-3">
<h3 id="sec-1-21"><span class="section-number-3">1.21</span> <span class="todo TODO">TODO</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-29 Mon</span></span> order RAM for stephen</h3>
<div class="outline-text-3" id="text-1-21">

<ul>
<li>RAM for Stephen, i946PL/GZ, DDR2-333 2x1GB, PC25300-u (333MHz 667
  Mb/s/pin)  [X]
</li>
<li>RS don't stock that RAM ^
</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2012-10-30 Tue</span></span> I will order the RAM if Stephen can find it
</li>
</ul>

</div>

</div>

<div id="outline-container-1-22" class="outline-3">
<h3 id="sec-1-22"><span class="section-number-3">1.22</span> <span class="done DONE">DONE</span> [X] <span class="timestamp-wrapper"> <span class="timestamp">2012-10-23 Tue</span></span> Find/order a second PIC programmer</h3>
<div class="outline-text-3" id="text-1-22">

<ul>
<li>MPLAB ICD3 [X] We already have a second one.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-23" class="outline-3">
<h3 id="sec-1-23"><span class="section-number-3">1.23</span> <span class="done DONE">DONE</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-30 Tue</span></span> Test APC in-couplers from BSP</h3>
<div class="outline-text-3" id="text-1-23">

<ul>
<li>Kevin's taken on this job
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> To do, Molecular Lab Experiments</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> [05-10-2012] Contact Parker about valve driver</h3>
<div class="outline-text-3" id="text-2-1">

<p>"Iota One" -&gt; compatible with series 9 pulsed valve?
Valve made by:
Pressure and Flow ltd: 01788 560426
Example part number: 009-1668-900
</p>
<p>
Iota One Pulse Valve Driver

</p>
<hr/>
<p>
Hello Nicholas,
</p>
<p> 
Please find the requested data attached.
</p>
<p> 
The 060-0001-900 are £3220.45 each. Delivery: 9 weeks.
</p>
<p> 
NOTE: This product is NOT CE marked and thus a written concesion is required when ordering!
</p>
<p> 
If you need further information or assistance, please do not hesitate to contact me.
</p>
<p> 
Best Regards,
</p>
<p> 
Nick Argyle
Sales Engineer
UK &amp; Ireland
Tel.: +44 (0) 1788 560426 / Fax: +44 (0) 1788 561228
E-Mail: uk@sensortechnics.com
</p>
<p>
Sensortechnics Ltd (a First Sensor Company)
Aspect Business Centre, 66C Somers Road, Rugby, Warks. CV22 7DH
Internet: www.sensortechnics.com
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <span class="done DONE">DONE</span> [09-10-2012] Inquire at Oxford about getting a pulsed valve driver made</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li>[10-10-2012] E-mail sent to Chris Rennick
</li>
<li>[10-10-2012] Chris might be able to send us one of their old
  controllers, different only in that it has an external HV supply
</li>
<li>Needs model resistance and inductance in case their circuit needs to
  be re-tuned to drive our valve
</li>
<li>The model we have is the 12 Watts/20VDC/594mA/33ohm one, no data on
  inductance, Amy might have measured it at 80mH. I'm measuring, using
  the LCR meter, 5.8 mH.
</li>
<li>Above data sent to Chris
</li>
<li>[11-10-2012] Chris checking details of our valve, and whether their
  spare will be needed soon
</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2012-10-22</span></span> No word from Chris since I heard from Laura that he was
  looking for it. Perhaps it's not to be found. The old pulsed valve
  circuit is nearly rebuilt, and Matthias has some designs from the
  Willitsch group in Basel for a different kind of piezo
  valve. Therefore I'm shelving this entry.
</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2012-10-23 Tue</span></span> *Update: Chris will send us his, and a spare pcb for us
  to make our own replacement
</li>
</ul>


</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <span class="done DONE">DONE</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-05 Fri</span></span> Test the PZT valve using leak-detector</h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> <span class="done DONE">DONE</span> [05-10-2012] Test with PZT amplifier</h4>
<div class="outline-text-4" id="text-2-3-1">

<ul>
<li>Opens and closes fully. 
</li>
<li>Voltages required not totally predictable, but if
  closed enough manually, and voltage high enough, then should be
  reliable. 
</li>
<li>PZT amplifier can't open and close fast enough to test
  dynamically. Must repair fast electronics
</li>
</ul>

</div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> <span class="done DONE">DONE</span> [08-10-2012] Order MOSFETs and driver</h4>
<div class="outline-text-4" id="text-2-3-2">

<ul>
<li>Mosfet
  Farnell: 9935584
  STP 20NM60FP: MOSFET N
</li>
<li>Driver
  Farnell: 1216117
  EL7104CN
</li>
<li>[08-10-2012] Ordered, Purchase order no. MPS/8010609 next day
  delivery 
</li>
</ul>


</div>

</div>

<div id="outline-container-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> <span class="done DONE">DONE</span> [08-10-2012] Repair electronics</h4>
<div class="outline-text-4" id="text-2-3-3">

<ul>
<li>Replace MOSFET and driver
</li>
<li>[09-10-2012] MOSFETs and driver have arrived
</li>
<li>Make new circuit board?
</li>
<li>[18-10-2012] New circuit board made
</li>
<li>Not working. Debug time.
</li>
<li>[22-10-2012] Still debugging, something wrong with wiring
  (transistors all functioning fine)
</li>
<li>Main board electronics are all functioning. Need to repair the
  MOSFET driver.
</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2012-10-23 Tue</span></span> We are getting a solenoid valve controller from Oxford,
  but I will finish this up anyway as a backup, in case performance
  from that controller/valve is not sufficient
</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2012-10-23 Tue</span></span> Valve electronics fixed, and will be shelved as a
  backup for the solenoid valve
</li>
</ul>


</div>

</div>
