2012/10/oct12.org
*** DONE [2012-10-23] Test pulsing w/ leak-detector
- Might as well double-check it while we wait for the solenoid-valve
  controller.
- <2012-10-24 Wed> Behaviour is difficult to characterise. Running the
  pulsing at moderate voltages (>50V) tends to see the system change
  its behaviour altogether as the needle/PZT configuration shifts.
- Regardless the behaviour I've seen is:
  * If the valve is closed loosely by hand, so that the pressure
    reading on the leak detector is *just* as low as it goes (3E-2
    mbar) when the voltage is high (140V, electronically closed), then
    difference between leak rates with the valve electronically open
    and closed can be up to two orders of magnitude (1E-4 ->
    1E-6). However when we slowly ramp up the voltage whilst pulsing,
    the change in pressure only gets down to one order of magnitude
    less, before the force from the pulsing starts to cause the valve
    to open out again. This happens typically around 50 to 60 volts.
  * If the valve is closed tightly, so that when electronically open
    (0V), the pressure is 3E-2 mbar,the rate difference is marginally
    larger for pulsing, up to almost two orders of magnitude at 70V,
    but the absolute rate is low (7E-4 mbarl/s open, 1E-5 mbarl/s
    closed). Higher voltages also start to change the settling point
    of the needle, as in the case above.
  * In either case, moderate voltages cause re-settling of the needle
    at 0V, making any experiments pretty difficult to reproduce. As
    such this may not be a practical system in the end.
- <2012-10-25 Thu> Going to try a different washer configuration. Less
  stiffness might give us better behaviour when pulsing, since the
  pressure doesn't seem to change much right now before the system
  starts to `deform'. I believe the current configuration is 4 washers
  placed as such: >><< . I'm going to try moving to >><
  configuration.
- Here's the thing. As I observed in the test setup with the laser
  blocking, the electronics seem to stop behaving properly at around
  60 V when pulsed. Any higher and the behaviour of the pulsed valve
  is worse, and it also seems to cause deformation of the
  configuration, so that results are not reproducible. This means that
  all pulsing must be at or below 60V. The problem with this is that
  even using static voltages to open and close the valve, the `dynamic
  range' of the valve is only one hundred at best e.g. leak rate of
  5E-4 mbarl/s to 5E-6 mbarl/s. Is the needle really opening out far
  enough? Is it closed enough? I suppose the next useful test is to
  see what the dynamic range is for different rates at `closing'
  voltage of 60V.
- NB 200us appears to be the optimal opening time for the valve (at
  10Hz). The electronics struggles with 100us so that we get higher
  leak rates (despite being `closed' for longer), and 300us clearly
  just gives us too long an opening time.
- Tested the dynamic range for different needle positions by manually
  closing down the valve in as small increments as possible. I managed
  to get a dynamic range of 10^4, and as long as I kept the voltage
  low (below 40V) this seemed reproducible - I got the same leak rates
  while open and while pulsed at 40V after three cycles of pulsing for
  a minute and turning off and opening the valve electronically.
- The result above would be sufficient for our system. But its a
  question whether or not I could get the same behaviour again, after
  the valve has been taken away to be welded onto a cf66 flange, and
  how often it would need to be re-adjusted, given its propensity to
  change behaviour at higher voltages. On top of this the optimal
  pulse time is 200us, which isn't even any faster than the solenoid
  valve we are getting a controller for soon. All-in-all, for the
  amount of effort put into it, it's perhaps not an effective or
  practical system, and it's going to be shelved until we have no
  other choices. Other choices currently are the solenoid valve, and
  the PZT valve design from the Basel group.
*** [x] [05-10-2012] Weld the valve into CF66 flange
- <2012-10-23 Tue> Shelved as a backup to the solenoid valve

** DONE <2012-10-23 Tue>  [X] Test the solenoid valve on the beam line
- <2012-10-23 Tue> Oxford valve controller is on its way, test
  immediately using pressure gauge? Discuss tests and trap
  incorporation at today's meeting
** TODO <2012-10-05 Fri> Code an automation program for experiments
- [[file:~/Documents/molecule_trap/automation/automation_project.org][project org file]]
- [05-10-2012] experiment:
  * Load Ca+
  * Load N2+
  * Apply dipole force
  * Configuration change check and re-arrange
  * Reload experiment
- [11-10-2012] Taking stock of hardware and software configs to lay out a plan of
  action.
- [16-10-2012] Figuring out how to read direct from memory
- <2012-10-23 Tue> Probably going to settle, to start with, with fixed
  measurement times and analysing complete files, just to get the
  infrastructure up.
- Hiroki wrote communication vi's to send commands to the p7888. It's
  not a difficult process anyway. All communication done with DDE vis
  (inbuilt) and the commands that need to be sent are in the p7888
  manual. 

** TODO <2012-10-05 Fri> Write simulation of 8-level atom for experiments
*** TODO Dark resonance spectroscopy/amplification
- [16-10-2012] Matthias has a reference (paper or lecture course) that
  shows a way in which we can account for laser linewidth in
  simulations. Chase up.
- <2012-10-23 Tue> Easiest thing right now is incorporate Wolfgang's
  matlab simulation into mine
*** Single ion-heat engine

** DONE [16-10-2012] Make sure 16-bit SCL is robust enough for Kevin's expt.
- [22-10-2012] Tested on Friday. Robust enough if locking point is
  fixed (no scan). There's either some issue with scanning up above R
  = 0.5, or some issue with locking altogether at those ratios.
- N.B. dsPic did a weird thing. When it was first started after having
  not been used for a while (maybe two weeks?), it didn't work
  properly. Communication to the chip from labVIEW worked fine, but it
  was not sending the confirmation echo back. The solution ended up
  being to reprogram the chip, which is not something we want to do
  often. The board was left on for the two weeks as far as I can
  tell, so that should be something to avoid and might help with this
  kind of problem. In likelihood one of the random power spikes that
  happens caused some partial wipe of the ROM. People should be warned
  about this

