2012/10/oct12.org
** TODO <2012-10-30 Tue> Test Oxford valve controller
- Matthias has a power supply we can use. It doesn't need to be high
  current since the current is supplied from a charged capacitor.
- <2012-10-31 Wed> No input for the power supply, have they sent us a
  different model than they meant to?
- Current testing is on an inductor coil chosen to roughly match that
  of the valve. A previous entry states that I measured the inductance
  to be roughly 5.8 mH recently. Lab notes from February suggest an
  inductance of 18 mH. Either way the closest inductor we have is 100
  mH, with 75 Ohm resistance. Given that the valve is 1 Ohm, are these
  similar enough to test, or different enough to have damaged the
  circuit?
** <2012-10-05 Fri> Construct/test molecular beamline

** <2012-10-05 Fri> Photoionisation of N2
Matthias, Jack after fibre-shooting

** <2012-10-05 Fri> N2+ spectroscopy
Will, inductively coupled RF discharge spectroscopy

** <2012-10-05 Fri> Install re-entrant window

** <2012-10-05 Fri> Walking wave setup
*** Investigate other labs techniques
**** Meschede
Two separate beam lines with individual AOMs (our likely choice)
**** Rempe
**** Wineland
**** Schiller

*** Test offline

** <2012-10-05 Fri> Frequency doubled 397 for SCL
-> April

** <2012-10-05 Fri> Fix up parallel DAC on SCL

** <2012-10-05 Fri> Migrate SCL to 32-bit dsPIC


* Journal & Theory club

** Journal club papers
*** DONE [12-10-2012]  Cold molecular reactions with quadrupole guide
*** TODO Brian Odom's manuscript
*** TODO Koehl's Dipole trap + ion trap
*** TODO Wielitsch's MOT + ion trap

** General papers
*** TODO J.D. Siverns et. al. 2011

** Theory subjects
*** TODO Applications for data analysis and simulation

** Books
- Molecular Quantum Mechanics, Aleins, Friedman


* To do, non-work

** DONE [05-10-2012] October LETS technology meeting
- [08-10-2012] Withdrawn

** DONE [05-10-2012] November LETS AGM
- [08-10-2012] Withdrawn

** DONE [08-10-2012] Contact lens meeting Friday 12 9:00
** DONE [08-10-2012] tidy.io feedback
- Clicking on "archive it" should not take you to the archive tab
- Make a way to select multiple folders
- Is there a way to indicate which files (with a date) have already been archived?
- [08-10-2012] Given!

** DONE [16-10-2012] Contact lens followup <2012-10-25 Thu>
** DONE [16-10-2012] Dara o Briain, Wed 17 20:00

** TODO <2012-10-22 Mon> Learn git
- [[http://git-scm.com/documentation][git tutorial links 1]]
- [[http://sixrevisions.com/resources/git-tutorials-beginners/][git tutorial links 2]]

** TODO <2012-11-07 Wed> New curtain solution for bedroom

* Handy org-mode sequences
** Motion
The following commands jump to other headlines in the buffer.
C-c C-n     (outline-next-visible-heading)
Next heading. 
C-c C-p     (outline-previous-visible-heading)
Previous heading. 
C-c C-f     (org-forward-same-level)
Next heading same level. 
C-c C-b     (org-backward-same-level)
Previous heading same level. 
C-c C-u     (outline-up-heading)
Backward to higher level heading. 

** Agenda
- "C-c ." insert active date from calendar
- "C-c !" insert inactive date from calendar
- "C-c C-d" insert deadline stamp from calendar
- "C-u C-c ." insert timestamp
- "S-left/right" move cursor in calndar buffer

** Links
- "C-c l" store link
- "C-c C-l" insert link (use with above)
- "C-u C-c C-l" insert link (filename completion)
- "C-c C-o" open link (or click)

** Export
- "C-c C-e h" export to HTML


