2012/10/oct12.html

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> <span class="todo TODO">TODO</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-30 Tue</span></span> Test Oxford valve controller</h3>
<div class="outline-text-3" id="text-2-8">

<ul>
<li>Matthias has a power supply we can use. It doesn't need to be high
  current since the current is supplied from a charged capacitor.
</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2012-10-31 Wed</span></span> No input for the power supply, have they sent us a
  different model than they meant to?
</li>
<li>Current testing is on an inductor coil chosen to roughly match that
  of the valve. A previous entry states that I measured the inductance
  to be roughly 5.8 mH recently. Lab notes from February suggest an
  inductance of 18 mH. Either way the closest inductor we have is 100
  mH, with 75 Ohm resistance. Given that the valve is 1 Ohm, are these
  similar enough to test, or different enough to have damaged the
  circuit?
</li>
</ul>

</div>

</div>

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-05 Fri</span></span> Construct/test molecular beamline</h3>
<div class="outline-text-3" id="text-2-9">


</div>

</div>

<div id="outline-container-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-05 Fri</span></span> Photoionisation of N2</h3>
<div class="outline-text-3" id="text-2-10">

<p>Matthias, Jack after fibre-shooting
</p>
</div>

</div>

<div id="outline-container-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-05 Fri</span></span> N2+ spectroscopy</h3>
<div class="outline-text-3" id="text-2-11">

<p>Will, inductively coupled RF discharge spectroscopy
</p>
</div>

</div>

<div id="outline-container-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="section-number-3">2.12</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-05 Fri</span></span> Install re-entrant window</h3>
<div class="outline-text-3" id="text-2-12">


</div>

</div>

<div id="outline-container-2-13" class="outline-3">
<h3 id="sec-2-13"><span class="section-number-3">2.13</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-05 Fri</span></span> Walking wave setup</h3>
<div class="outline-text-3" id="text-2-13">


</div>

<div id="outline-container-2-13-1" class="outline-4">
<h4 id="sec-2-13-1"><span class="section-number-4">2.13.1</span> Investigate other labs techniques</h4>
<div class="outline-text-4" id="text-2-13-1">

<ul>
<li id="sec-2-13-1-1">Meschede<br/>
Two separate beam lines with individual AOMs (our likely choice)
</li>
</ul>
<ul>
<li id="sec-2-13-1-2">Rempe<br/>
</li>
</ul>
<ul>
<li id="sec-2-13-1-3">Wineland<br/>
</li>
</ul>
<ul>
<li id="sec-2-13-1-4">Schiller<br/>

</li>
</ul>
</div>

</div>

<div id="outline-container-2-13-2" class="outline-4">
<h4 id="sec-2-13-2"><span class="section-number-4">2.13.2</span> Test offline</h4>
<div class="outline-text-4" id="text-2-13-2">


</div>
</div>

</div>

<div id="outline-container-2-14" class="outline-3">
<h3 id="sec-2-14"><span class="section-number-3">2.14</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-05 Fri</span></span> Frequency doubled 397 for SCL</h3>
<div class="outline-text-3" id="text-2-14">

<p>-&gt; April
</p>
</div>

</div>

<div id="outline-container-2-15" class="outline-3">
<h3 id="sec-2-15"><span class="section-number-3">2.15</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-05 Fri</span></span> Fix up parallel DAC on SCL</h3>
<div class="outline-text-3" id="text-2-15">


</div>

</div>

<div id="outline-container-2-16" class="outline-3">
<h3 id="sec-2-16"><span class="section-number-3">2.16</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-05 Fri</span></span> Migrate SCL to 32-bit dsPIC</h3>
<div class="outline-text-3" id="text-2-16">



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Journal &amp; Theory club</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Journal club papers</h3>
<div class="outline-text-3" id="text-3-1">


</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> <span class="done DONE">DONE</span> [12-10-2012]  Cold molecular reactions with quadrupole guide</h4>
<div class="outline-text-4" id="text-3-1-1">

</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> <span class="todo TODO">TODO</span> Brian Odom's manuscript</h4>
<div class="outline-text-4" id="text-3-1-2">

</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> <span class="todo TODO">TODO</span> Koehl's Dipole trap + ion trap</h4>
<div class="outline-text-4" id="text-3-1-3">

</div>

</div>

<div id="outline-container-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> <span class="todo TODO">TODO</span> Wielitsch's MOT + ion trap</h4>
<div class="outline-text-4" id="text-3-1-4">


</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> General papers</h3>
<div class="outline-text-3" id="text-3-2">


</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> <span class="todo TODO">TODO</span> J.D. Siverns et. al. 2011</h4>
<div class="outline-text-4" id="text-3-2-1">


</div>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Theory subjects</h3>
<div class="outline-text-3" id="text-3-3">


</div>

<div id="outline-container-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> <span class="todo TODO">TODO</span> Applications for data analysis and simulation</h4>
<div class="outline-text-4" id="text-3-3-1">


</div>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Books</h3>
<div class="outline-text-3" id="text-3-4">

<ul>
<li>Molecular Quantum Mechanics, Aleins, Friedman
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> To do, non-work</h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <span class="done DONE">DONE</span> [05-10-2012] October LETS technology meeting</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>[08-10-2012] Withdrawn
</li>
</ul>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <span class="done DONE">DONE</span> [05-10-2012] November LETS AGM</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>[08-10-2012] Withdrawn
</li>
</ul>


</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> <span class="done DONE">DONE</span> [08-10-2012] Contact lens meeting Friday 12 9:00</h3>
<div class="outline-text-3" id="text-4-3">

</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> <span class="done DONE">DONE</span> [08-10-2012] tidy.io feedback</h3>
<div class="outline-text-3" id="text-4-4">

<ul>
<li>Clicking on "archive it" should not take you to the archive tab
</li>
<li>Make a way to select multiple folders
</li>
<li>Is there a way to indicate which files (with a date) have already been archived?
</li>
<li>[08-10-2012] Given!
</li>
</ul>


</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> <span class="done DONE">DONE</span> [16-10-2012] Contact lens followup <span class="timestamp-wrapper"> <span class="timestamp">2012-10-25 Thu</span></span></h3>
<div class="outline-text-3" id="text-4-5">

</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> <span class="done DONE">DONE</span> [16-10-2012] Dara o Briain, Wed 17 20:00</h3>
<div class="outline-text-3" id="text-4-6">


</div>

</div>

<div id="outline-container-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> <span class="todo TODO">TODO</span> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-22 Mon</span></span> Learn git</h3>
<div class="outline-text-3" id="text-4-7">

<ul>
<li><a href="http://git-scm.com/documentation">git tutorial links 1</a>
</li>
<li><a href="http://sixrevisions.com/resources/git-tutorials-beginners/">git tutorial links 2</a>
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Handy org-mode sequences</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Motion</h3>
<div class="outline-text-3" id="text-5-1">

<p>The following commands jump to other headlines in the buffer.
C-c C-n     (outline-next-visible-heading)
Next heading. 
C-c C-p     (outline-previous-visible-heading)
Previous heading. 
C-c C-f     (org-forward-same-level)
Next heading same level. 
C-c C-b     (org-backward-same-level)
Previous heading same level. 
C-c C-u     (outline-up-heading)
Backward to higher level heading. 
</p>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Agenda</h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li>"C-c ." insert active date from calendar
</li>
<li>"C-c !" insert inactive date from calendar
</li>
<li>"C-c C-d" insert deadline stamp from calendar
</li>
<li>"C-u C-c ." insert timestamp
</li>
<li>"S-left/right" move cursor in calndar buffer
</li>
</ul>


</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Links</h3>
<div class="outline-text-3" id="text-5-3">

<ul>
<li>"C-c l" store link
</li>
<li>"C-c C-l" insert link (use with above)
</li>
<li>"C-u C-c C-l" insert link (filename completion)
</li>
<li>"C-c C-o" open link (or click)
</li>
</ul>


</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Export</h3>
<div class="outline-text-3" id="text-5-4">

<ul>
<li>"C-c C-e h" export to HTML
</li>
</ul>



</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-11-06 11:35:11 GMT</p>
<p class="author">Author: Nic</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
